namespace Kinlo.SharedBase.Enums;

/// <summary>
/// 工序类型
/// </summary>
[Languages]
public enum ProcessTypeEnum : byte
{
   [Languages("PLC")]
   PLC = 0,
   设备状态 = 1,
   前扫码 = 11,
   后扫码 = 12,
   装盘扫码 = 13,
   拆盘扫码 = 14,
   托盘扫码 = 15,
   套杯扫码 = 16,
   下料扫码 = 17,
   返回托盘ID = 18,
   回流扫码 = 19,
   MES装盘数据 = 25,
   拆盘数据 = 26,
   测短路 = 31,
   测电压 = 32,
   测厚 = 33,
   计算电压极差 = 34,
   前称重 = 51,
   前称重清零 = 52,
   后称重 = 53,
   后称重清零 = 54,
   下料称重 = 55,
   下料称重清零 = 56,
   手动补液 = 57,
   补液称清零 = 58,

   //手工补液称 = 59,
   回氦称重 = 60,
   回氦称重清零 = 61,

   [Languages("回流补液")]
   回流补液 = 62,

   [Languages("注液后称重")]
   注液后称重 = 63, //新项目应该把NG工位和生产工位分开，用俩个enum来处理，此处为兼容旧项目
   注液量发送 = 71,
   补液量发送 = 72,

   [Languages("注液")]
   注液 = 73,
   测漏 = 74,
   最终注液结果=75,
   //静置站 = 75,

   [Languages("静置站金寨")]
   静置站 = 76,
   CCD检测 = 81,
   回氦 = 91,

   [Languages("回氦打钢珠")]
   回氦打钢珠 = 92,

   [Languages("打钢珠")]
   打钢珠 = 93,
   打钉检测 = 101,
   拔钉前检测 = 102,
   预压钉 = 103,
   全压钉 = 104,
   真空打钉 = 105,
   回流打钉检测 = 106,
   组装线前扫码,
   滚槽后CCD,
   整形后检测,
   封口后CCD,
   封口后检测,
   注液站浓度,
   储液柜浓度,
   补液站浓度,
   参数修改通知MES,
   复投,

   // 自定义启动仪器 =251,
   清洗机出站 = 252,
   出站 = 253,
   MES = 254,
   _ = 255,
}
/// <summary>
/// 工序类型扩展，因为有些工序有多个结果，主要用于界面显示和统计分析
/// </summary>
//[Languages]
//public enum ProcessTypeExpandEnum
//{
//    [Languages("首次注液", "首次注液","first inject")] 首次注液 = 0,
//  //  [Languages("最终注液", "最终注液", "final inject")] 最终注液 = 1,
//}
